// 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница
//каждому числу задаем переменную 
Console.Write("Введите номер от 1 до 7");
string day = Console.ReadLine();
if (day == 1) (
    Console.ReadLine("Понедельник")